Revit 2026 API

# ParameterTypeIdEnergyAnalysisCreateAnalyticalModel Property

---

"Create Energy Model"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId EnergyAnalysisCreateAnalyticalModel { get; }
```
```vb
Public Shared ReadOnly Property EnergyAnalysisCreateAnalyticalModel As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ EnergyAnalysisCreateAnalyticalModel {
	ForgeTypeId^ get ();
}
```
```fsharp
static member EnergyAnalysisCreateAnalyticalModel : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace